#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudsbits/audiotube-org/runs/run-jugXTRpbUpxqMUg6

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.block_cloudtrial_configuration_policy: Refreshing...
data.aws_iam_policy_document.deny_leave_org_policy: Refreshing...
aws_organizations_organization.audiotube: Refreshing state... [id=o-nb5t6tuqud]
data.aws_iam_policy_document.deny_leave_org_policy: Refresh complete after 0s [id=1881740481]
data.aws_iam_policy_document.block_cloudtrial_configuration_policy: Refresh complete after 0s [id=652164004]
aws_organizations_policy.cloudtrail_config_policy: Refreshing state... [id=p-0y9tewpl]
aws_organizations_organizational_unit.infrastructure: Refreshing state... [id=ou-wpeg-t9b3a9yd]
aws_organizations_organizational_unit.security: Refreshing state... [id=ou-wpeg-6oqi13qq]
aws_organizations_organizational_unit.workloads: Refreshing state... [id=ou-wpeg-czpfa1g5]
aws_organizations_organizational_unit.workloads_prod: Refreshing state... [id=ou-wpeg-h2gx0s8v]
aws_organizations_organizational_unit.sandbox: Refreshing state... [id=ou-wpeg-lge8a0cn]
aws_organizations_organizational_unit.prod: Refreshing state... [id=ou-wpeg-gt7e70bu]
aws_organizations_organizational_unit.workloads_preprod: Refreshing state... [id=ou-wpeg-xc6lidil]
aws_organizations_organizational_unit.infrastructure_prod: Refreshing state... [id=ou-wpeg-jfv4hz65]
aws_organizations_organizational_unit.infrastructure_preprod: Refreshing state... [id=ou-wpeg-8lyfjtup]
aws_organizations_account.audiotube_workloads_prod: Refreshing state... [id=022226443461]
aws_organizations_account.audiotube_infrastructure_prod: Refreshing state... [id=492591972950]
aws_organizations_account.audiotube_infrastructure_preprod: Refreshing state... [id=064787544343]
aws_organizations_account.audiotube_workloads_preprod: Refreshing state... [id=155602617137]
aws_organizations_account.audiotube_security_prod: Refreshing state... [id=950781446058]
aws_organizations_account.audiotube_sandbox: Refreshing state... [id=257625454150]
aws_organizations_policy_attachment.sandbox: Refreshing state... [id=257625454150:p-0y9tewpl]
aws_organizations_policy.cloudtrail_config_policy: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_policy.deny_leave_org will be created
  + resource "aws_organizations_policy" "deny_leave_org" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "organizations:LeaveOrganization"
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "Denies leaving the organization"
      + id          = (known after apply)
      + name        = "Deny Leave Organization"
      + tags_all    = (known after apply)
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.deny_leave_org_attachment will be created
  + resource "aws_organizations_policy_attachment" "deny_leave_org_attachment" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "257625454150"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 20 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*